goal_app/app/controllers/users_controller.rb

  def create
    # user = User.new(username: 'louis', password: 'password')
    user = User.new(username: user_params[:username], password: user_params[:password])

    if user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)